Repository: guilamu/gf-external-choices
Catalog: languages/gf-external-choices-*.po
Languages: fr_fr

source: Gravity Forms External Choices
fr_fr: Gravity Forms Choix Externes

source: Populate Gravity Forms Multiple Choice fields from external CSV, JSON, or XLSX data sources.
fr_fr: Remplir les champs à choix multiples de Gravity Forms à partir de sources de données externes CSV, JSON ou XLSX.

source: External Choices
fr_fr: Choix externes

source: Populate choices from an external CSV or JSON file. The file can be from a URL or uploaded to your Media Library.
fr_fr: Remplir les choix à partir d'un fichier CSV ou JSON externe. Le fichier peut provenir d'une URL ou être téléchargé dans votre bibliothèque de médias.

source: Source Type
fr_fr: Type de source

source: Manual (Default)
fr_fr: Manuel (Par défaut)

source: External URL
fr_fr: URL externe

source: Media Library
fr_fr: Bibliothèque de médias

source: Media File
fr_fr: Fichier média

source: No file selected
fr_fr: Aucun fichier sélectionné

source: Select File
fr_fr: Sélectionner un fichier

source: Label Column/Property
fr_fr: Colonne/Propriété du libellé

source: -- Select Column --
fr_fr: -- Sélectionner une colonne --

source: Value Column/Property
fr_fr: Colonne/Propriété de la valeur

source: Refresh Frequency
fr_fr: Fréquence de rafraîchissement

source: Hourly
fr_fr: Toutes les heures

source: Daily
fr_fr: Quotidien

source: Weekly
fr_fr: Hebdomadaire

source: Force Refresh
fr_fr: Forcer le rafraîchissement

source: File selected (ID:
fr_fr: Fichier sélectionné (ID :

source: URL is empty.
fr_fr: L'URL est vide.

source: Failed to fetch URL: %s
fr_fr: Échec de la récupération de l'URL : %s

source: HTTP error: %d
fr_fr: Erreur HTTP : %d

source: File exceeds maximum size of %s.
fr_fr: Le fichier dépasse la taille maximale de %s.

source: Media file not found.
fr_fr: Fichier média introuvable.

source: Failed to read media file.
fr_fr: Échec de la lecture du fichier média.

source: CSV data is empty.
fr_fr: Les données CSV sont vides.

source: CSV must have a header row and at least one data row.
fr_fr: Le CSV doit avoir une ligne d'en-tête et au moins une ligne de données.

source: No valid choices found in CSV.
fr_fr: Aucun choix valide trouvé dans le CSV.

source: JSON data is empty.
fr_fr: Les données JSON sont vides.

source: JSON parse error: %s
fr_fr: Erreur d'analyse JSON : %s

source: JSON must be an array at the root level.
fr_fr: Le JSON doit être un tableau au niveau racine.

source: JSON array is empty.
fr_fr: Le tableau JSON est vide.

source: JSON must contain flat objects only. Nested objects are not supported in this version.
fr_fr: Le JSON ne doit contenir que des objets plats. Les objets imbriqués ne sont pas pris en charge dans cette version.

source: No valid choices found in JSON.
fr_fr: Aucun choix valide trouvé dans le JSON.

source: JSON must be a non-empty array.
fr_fr: Le JSON doit être un tableau non vide.

source: JSON array must contain objects.
fr_fr: Le tableau JSON doit contenir des objets.

source: XLSX must have a header row and at least one data row.
fr_fr: Le XLSX doit avoir une ligne d'en-tête et au moins une ligne de données.

source: No valid choices found in XLSX.
fr_fr: Aucun choix valide trouvé dans le XLSX.

source: XLSX file is empty.
fr_fr: Le fichier XLSX est vide.

source: PHP ZipArchive extension is required for XLSX support.
fr_fr: L'extension PHP ZipArchive est requise pour la prise en charge des fichiers XLSX.

source: XLSX file not found.
fr_fr: Fichier XLSX introuvable.

source: Failed to open XLSX file.
fr_fr: Échec de l'ouverture du fichier XLSX.

source: No worksheet found in XLSX file.
fr_fr: Aucune feuille de calcul trouvée dans le fichier XLSX.

source: Failed to parse worksheet XML.
fr_fr: Échec de l'analyse du XML de la feuille de calcul.

source: Unable to rename the update folder. Please retry or update manually.
fr_fr: Impossible de renommer le dossier de mise à jour. Veuillez réessayer ou mettre à jour manuellement.
